Repository: lorenzoalaniztalan/talantimefront
Catalog: lib/l10n/arb/app_*.arb
Languages: es

# appSlogan
source: Intuitive and efficient. Regain control of your work hours without perishing in the process.
es: Intuitiva y eficiente. Recupera el control de tus horas laborales sin perder la vida en el proceso.

# defaultServerError
source: Server error
es: Error de servidor

# serverErrorAuthenticationError
source: Authentication failure
es: Error de credenciales

# serverResponseAuthenticationSuccess
source: Authenticated
es: Autenticado

# serverErrorRegisterErrorGeneric
source: Error registering user
es: Error registrando usuario

# serverErrorRegisterErrorConflict
source: User already exists
es: Ya existe ese usuario

# serverErrorRegisterErrorInvalidTalanEmail
source: Invalid email. User's email must end with “@talan.com”
es: Email no válido. El email debe tener el dominio “@talan.com”

# serverResponseRegisterSuccess
source: Registration successful
es: Usuario registrado

source: Today
es: Hoy

source: From
es: Desde

source: To
es: Hasta

# confirm
source: Validate
es: Validar

source: Back
es: Atrás

source: Edit
es: Editar

source: Save
es: Guardar

source: Clock in
es: Fichar

source: Delete
es: Eliminar

source: Remove
es: Borrar

source: Cancel
es: Cancelar

source: Log out
es: Cerrar sesión

source: Download
es: Descargar

source: Select all
es: Todos

# copyrights
source: © 2023 Talan, Inc. All rights reserved.
es: © 2023 Talan, Inc. Todos los derechos reservados.

# drawerMenuLanguageSwitchLabel
source: Language
es: Idioma

# drawerMenuThemeSwitchLabel
source: Mode
es: Modo

# homePageHomeSectionTitle
source: Home
es: Inicio

# homePageSubmitScheduleSectionTitle
source: Time entry
es: Fichar horario

# homePageHistorySectionTitle
source: History
es: Historial

# homePageWelcomeTitleOne
source: Welcome to Talantime!
es: ¡Bienvenido a Talantime!

# homePageWelcomeOneSubtitleOne
source: We present you this intuitive and efficient tool that will simplify your work experience. With our application, you will be able to register your work hours easily and quickly, without complications or unnecessary paperwork.
es: Te presentamos esta herramienta intuitiva y eficiente que simplificará tu experiencia laboral. Con nuestra aplicación, podrás registrar tus horarios de trabajo de manera fácil y rápida, sin complicaciones ni papeleos innecesarios.

# homePageWelcomeOneSubtitleTwo
source: You will no longer have to worry about losing control of your working hours, as our app will help you keep track of them in an accurate and organized way.
es: Ya no tendrás que preocuparte por perder el control de tus horas laborales, ya que nuestra web app te ayudará a mantener un seguimiento preciso y organizado.

# homePageWelcomeTitleTwo
source: Thinking of you and your needs
es: Pensando en ti y en tus necesidades

# homePageWelcomeTwoSubtitleOne
source: We offer you a friendly and easy-to-use interface, where you can easily register your signing hours.You will also be able to consult your previous signings, verify your accumulated hours and keep track of your breaks.
es: Te ofrecemos una interfaz amigable y fácil de usar, donde podrás registrar tus entradas y salidas de forma sencilla. Además, podrás consultar tus horarios previos, verificar tus horas acumuladas y realizar un seguimiento de tus pausas y descansos.

# homePageWelcomeTwoSubtitleTwo
source: With this detailed information at your fingertips, you can have full control over your hours worked and ensure you meet your job responsibilities.
es: Con esta información detallada a tu alcance, podrás tener un control total sobre tus horas trabajadas y asegurarte de cumplir con tus responsabilidades laborales.

# homePageWelcomeTitleThree
source: And that's not all
es: Y eso no es todo

# homePageWelcomeThreeSubtitleOne
source: We also provide the ability to generate reports and export your time record data. This feature will make it easier for you to comply with administrative procedures and will save you time when submitting reports to your supervisor or human resources department.
es: También brindamos la posibilidad de generar informes y exportar los datos de tu registro de horarios. Esta característica te facilitará el cumplimiento de trámites administrativos y te ahorrará tiempo al momento de presentar informes a tu supervisor o departamento de recursos humanos.

# homePageWelcomeThreeSubtitleTwo
source: In essence, our app is an essential tool that allows you to optimize your productivity and keep a rigorous control of your working hours.
es: En resumen, nuestra web app de registro de horarios de trabajo diario es una herramienta imprescindible para optimizar tu productividad y llevar un control riguroso de tus horas laborales.

# homePageWelcomeTitleFour
source: Enjoy a more efficient and accurate labor management!
es: ¡Disfruta de una gestión laboral más eficiente y precisa!

# scheduleConfirmedSuccessMessage
source: Schedule submitted
es: Horario validado

# scheduleConfirmedErrorMessage
source: Error submitting schedule
es: Error validando horario

# scheduleConfirmHoursButton
source: Validate
es: Validar fichaje

# scheduleConfirmHoursDialogTitle
source: Confirming hours
es: Validando horas

# scheduleConfirmHoursDialogMessage
source: Validate the selected schedule for this month?
es: ¿Estás seguro de que deseas validar este horario?

# scheduleUnconfirmedPreviousMonthsAlert
source: You have previous months pending confirmation.
es: Tienes meses anteriores pendientes de validación.

# scheduleConfirmedHoursButton
source: Time entries validated
es: Fichaje validado

# scheduleUnconfirmedPreviousMonthsTitle
source: No validated months
es: Meses pendientes

# scheduleConfirmedHoursTitle
source: Schedule on
es: Fichaje de

# scheduleConfirmedHoursSubtitleOne
source: These are your time entries already validated for
es: Este es tu fichaje de horas ya archivado para

# scheduleConfirmedHoursSubtitleTwo
source: To consult the signing of a day, place the cursor over that day or click it
es: Para consultar el fichaje de un día, coloca el cursor encima de ese día o pínchalo

# scheduleUnconfirmedHoursTitle
source: Suggested time entries
es: Fichaje de horas sugerido

# scheduleConfirmHoursUnsavedTitle
source: Unsaved changes
es: Cambios sin guardar

# scheduleConfirmHoursUnsavedMessage
source: You have not saved your changes in the current month. Continue without saving?
es: Tienes cambios sin guardar en el mes actual. Si continuas perderás los cambios.

# scheduleConfirmHoursUnsavedContinue
source: Continue without saving
es: Continuar sin guardar

# scheduleConfirmedHoursServerError
source: We couldn't retrieve your schedule info
es: No pudimos verificar tu fichaje de horas

# scheduleUnconfirmedHoursSubtitleOne
source: Based on your usual working hours, these are your suggested signings for
es: Basado en tu horario habitual, este es tu fichaje de horas sugerido para

# scheduleUnconfirmedHoursSubtitleTwo
source: To edit a specific, select the day and click on “Edit”
es: Para editar un fichaje en particular, pincha el día puntual y haz click en “Editar”

# scheduleUnconfirmedHoursSubtitleThree
source: To validate the schedule, click on “Confirm”
es: Para validar el fichaje de horas, pincha en “Validar fichaje”

# scheduleDeleteScheduleButton
source: Delete
es: Eliminar fichaje

# scheduleDeleteScheduleModalTitle
source: Deleting hours
es: Eliminar horas

# scheduleDeleteScheduleModalSubtitleOne
source: You are about to delete all validated days and absences for
es: Estás a punto de eliminar todas las entradas de horas y ausencias de

# historyPageTitle
source: Schedule history
es: Historial de fichajes

# historyPageSubtitleOne
source: This is your archived and validated time sheet.
es: Este es tu fichaje de horas validado y archivado.

source: Weekend
es: Fin de semana

source: Absence
es: Ausencia

# bankHolidays
source: Bank holiday
es: Festivo

source: No data
es: Sin datos

# scheduleCheckIn
source: Check in
es: Entrada

# scheduleRestStart
source: Time break
es: Inicio descanso

# scheduleRestEnd
source: Return
es: Fin descanso

# scheduleCheckOut
source: Check out
es: Salida

# settingsPageTitle
source: Settings
es: Ajustes

# settingsPageSubtitleOne
source: Edit your usual schedule with the hours in which you are frequently available.
es: Edita tu horario habitual con las horas en las que frecuentemente estás disponible.

# settingsPageSubtitleOneLink
source: Edit usual schedule
es: Editar horario habitual

# loginPageNoAccountLabel
source: Don't have an account?
es: ¿No tienes cuenta?

# loginPageSubmitButton
source: Login
es: Entrar

# linkToRegister
source: Create account
es: Crear cuenta

# registerPageHasAccountLabel
source: Already a user?
es: ¿Ya tienes cuenta?

# registerPageSubmitButton
source: Create account
es: Crear cuenta

# registerPageLinkToLogin
source: Use my account
es: Entrar con mi cuenta

# registerPageSuccessHeader
source: Thanks for signing up!
es: ¡Gracias por suscribirte!

# registerPageSuccessSubheader
source: Go to your email and finish your registration
es: Dirígete a tu email y completa el registro

# registerPageBackToLogin
source: Go to login page
es: Ir a pantalla de autenticación

# inputControllerFirstnameLabel
source: Name
es: Nombre

# inputControllerFirstnameError
source: Invalid name
es: Nombre no válido

# inputControllerLastnameLabel
source: Last name
es: Apellido(s)

# inputControllerLastnameError
source: Invalid last name
es: Apellido(s) no válidos

# inputControllerEmployeeIdLabel
source: DNI/NIE/Passport
es: DNI/NIE/Pasaporte

# inputControllerEmployeeIdError
source: Invalid DNI/NIE/Passport format
es: Formato de DNI/NIE/Pasaporte no válido

# inputControllerEmailError
source: Invalid email
es: Email no válido

# inputControllerEmailErrorTalanInvalid
source: Must be a valid “@talan.com” email
es: Debe ser un email “@talan.com”

# inputControllerOfficeLabel
source: Office
es: Oficina

# inputControllerOfficeError
source: Invalid office
es: Oficina no válida

# inputControllerPasswordLabel
source: Password
es: Contraseña

# inputControllerPasswordError
source: Invalid password
es: Contraseña no válida

# inputControllerPasswordErrorShort
source: At least 6 character long
es: Debe tener al menos 6 caracteres

# inputControllerRepeatedPasswordLabel
source: Repeat password
es: Repite la contraseña

# inputControllerRepeatedPasswordError
source: Passwords must match
es: Las contraseñas no coinciden

# inputControllerRegistrationDateLabel
source: Talan joining date
es: Fecha de alta en Talan

# inputControllerRegistrationDateError
source: Invalid registration date
es: Fecha de registro no válida

# editAvatarTitle
source: Edit avatar
es: Editar foto

# editAvatarSuccessMessage
source: Photo updated
es: Foto actualizada

# editAvatarErrorMessage
source: Error uploading photo
es: Error actualizando foto

# editAvatarUploadImageButton
source: Upload image
es: Subir foto

# editAvatarDeleteImageButton
source: Remove image
es: Borrar foto

# usualScheduleHoursTitle
source: Set your usual schedule
es: Indica tu horario habitual

# usualSchedulePageCheckError
source: We couldn't check your usual schedule
es: No pudimos verificar tu horario habitual

# usualScheduleCheckingHoursTitle
source: Checking your usual schedule
es: Verificando tu horario habitual

# usualScheduleCheckinTimeError
source: Invalid check in time
es: Entrada no válida

# usualScheduleBreakTimeError
source: Break must happen after check in
es: Inicio descanso debe ocurrir después de entrada

# usualScheduleReturnTimeError
source: Return must happen after break
es: Fin descanso debe ocurrir después del inicio

# usualScheduleCheckoutTimeError
source: Check out must happen after return
es: Salida debe ocurrir después de fin descanso

# usualScheduleFullTimeError
source: Make sure your hours sum up a total of 8h
es: Tus horas deben sumar 8h

# usualScheduleOneHourBreakLabel
source: Duration of time break
es: Duración del descanso

# usualScheduleOneHourBreakError
source: Make sure your break is exactly 1h long
es: Tu descanso debe durar exactamante 1h

# usualScheduleSubmittedSuccessMessage
source: Usual schedule updated
es: Horario actualizado

# usualScheduleSubmittedErrorMessage
source: Error updating usual schedule
es: Error actualizando horario

source: Broken link
es: Enlace corrupto

# emailVerificationPageVerifyingEmail
source: Verifying email ...
es: Verificando email ...

# emailVerificationPageVerificationSuccess
source: Email verified!
es: ¡Email verificado!

# emailVerificationPageRedirecting
source: redirecting ...
es: redirigiendo ...

# scheduleDayAbsenceDayDescription
source: Absence day
es: Día de ausencia

# scheduleDayNonWorkingDayDescription
source: Bank holiday
es: Día festivo

source: Date
es: Día

# scheduleDayAbsenceTypeControllerLabel
source: Reason of absence
es: Motivo de ausencia

# scheduleDayAbsenceTypeControllerError
source: Invalid reason
es: Motivo de ausencia no válido

# scheduleDaySwitcherButtonRegisterWorkingDay
source: Register work day
es: Registrar jornada

# scheduleDaySwitcherButtonRegisterAbsenceDay
source: Register absence
es: Registrar ausencia

# resetPasswordButton
source: Reset password
es: Restablecer contraseña

# resetPasswordSuccessTitle
source: Password changed successfully
es: Contraseña restablecida

# resetPasswordSuccessSubtitle
source: You can now use your new password to authenticate
es: Ya puedes usar tu nueva contraseña para autenticarte

# serverResponseResetPasswordSuccess
source: Password updated
es: Contraseña actualizada

# resetPasswordRequestTitle
source: We will send you an email to help reset your password
es: Te enviaremos un email para asistirte en tu solicitud

# resetPasswordRequestSuccessTitle
source: Request received
es: Solicitud recibida

# resetPasswordRequestSuccessSubtitle
source: Go to your email to continue with your password reset
es: Dirígete a tu email y completa tu solicitud

# adminPageSubtitleOne
source: Register new users on Talantime. Assign them an office and a creation date.
es: Registra nuevos usuarios en Talantime. Asígnales una oficina y su fecha de registro.

source: Users
es: Usuarios

# generateReportSubtitle
source: Get time entries by users and generate a report in PDF format
es: Consulta los fichajes de los usuarios y genere un informe en formato PDF

# generateReportCallToActionButton
source: Report
es: Informe

# generateReportModalTitle
source: Generate report
es: Generar informe
